<template>
	<view>

		<view v-if="type == 0" class="protocol-wrap">
			<view class="protocol-title">
				<text>一亩莲用户协议</text>
			</view>
			<view class="protocol-body">
				<text>
					用户在使用技术开发方（即，以下统称“技术开发方”）提供的各项服务之前，应仔细阅读本《用户协议》（以下简称“本协议”）。用户一旦登录或使用技术开发方的服务，即视为用户已了解并明示同意本协议各项内容，本协议立即在用户与本技术开发方之间产生法律效力。用户登录、使用本产品服务的全部活动将受到本协议的约束并承担相应的责任和义务。如用户不同意本协议任何内容的，请用户立即停止使用技术开发方所提供的全部服务。
					根据《中华人民共和国网络安全法》、《电信和互联网用户个人信息保护规定》及相关法律法规的规定，同时依据技术开发方与其合作伙伴之间的相关协议，用户必须已明示授权技术开发方合作伙伴（以下简称“合作伙伴”）、在此明示授权并委托技术开发方及其关联公司通过官方或相关实名认证平台、及其它相关平台查询、验证、存储用户的个人信用信息，并输出给合作伙伴对用户的个人信用进行评估与参考使用。用户理解并同意，具体的授权查询、验证、存储及输出的内容以合作伙伴要求查询、验证、存储、输出以及技术开发方及其关联公司实际查询、验证、存储、输出的信息为准。技术开发方及其关联公司会在授权范围内对相关个人信息予以处理（包括但不限于为保护用户个人信息而加密处理、掩码处理等一切为实现相关协议目的而进行的所有必要处理）并仅提供给合作伙伴使用，但用户与合作伙伴之间因授权的有效性、授权内容、授权范围、授权期限等发生的争议纠纷与技术开发方无关。如用户对合作伙伴的上述授权事项有任何异议或争议的，应立即停止使用技术开发方所提供的全部服务。用户使用本服务的，即表明用户已明示对合作伙伴、技术开发方及其关联公司授权查询、验证、处理、存储、在约定范围内使用其个人信息，并对授权的效力、查询验证的内容、查询验证平台、处理方式、使用范围等相关事项无任何事实或法律上的异议或争议。
					鉴于用户须授权合作伙伴并由该合作伙伴告知本服务后方能进入、登录并使用本服务，用户登录或使用本服务时起即视为用户与技术开发方的合作伙伴之间已存在合法的、充分的、必要的、不可撤销的授权，且用户已清楚知晓其授权提供相关信息可能对其造成的相关不利影响，如负面的信用评价等。为保护用户个人信息，技术开发方会采取合理措施对用户信息进行严格保密，同时督促并要求该特定合作伙伴进行严格保密。未经用户授权，技术开发方及其关联公司不会将用户信息提供给任何其他方。
					一、协议主体
					本协议是用户与技术开发方关于用户使用本服务所订立的协议。
					二、关于本服务
					1. 本服务内容是指技术开发方通过本应用程序向其合作伙伴及用户提供的相关服务（简称“本服务”）。
					2. 对用户使用的本服务，技术开发方会不断丰富用户使用本服务的终端、形式等。
					3. 许可的范围：
					（1）技术开发方授予用户一项个人的、不可转让及非排他性的许可，以使用本应用程序。
					（2）本条及本协议其他条款未明示授权的其他一切知识产权权利仍由技术开发方保留。技术开发方如果未行使前述任何权利，并不构成对该权利的放弃。
					三、账号登录
					为使用本应用程序用户可能需要输入个人信息进行登录与使用。
					用户清楚知晓，其向技术开发方提供的账户仅限本人使用，否则，用户可能会对用户或他人造成侵权。用户承诺并同意，使用同一设备、同一身份证号或账号使用本协议项下服务的，均视为用户本人的行为。用户应妥善保管自身设备、身份证件及账号密码信息，审慎交由他人使用或使用他人设备、身份证件或账户信息，如用户违反本约定给用户或他人造成损失的，技术开发方不应也不会承担任何法律责任。用户若因此给技术开发方造成损失的，应承担技术开发方所遭受的全部损失。
					四、应用程序的使用
					如果用户从非技术开发方合作伙伴的应用程序或非技术开发方合作伙伴处获取本应用程序或与本应用程序名称相同的安装程序，技术开发方无法保证该应用程序能够正常使用，并对因此给用户造成的损失不予负责。
					五、应用程序的更新
					1. 为了增进用户体验、完善服务内容，技术开发方将不断努力为用户时时提供应用程序更新（这些更新可能会采取应用程序替换、修改、功能强化、版本升级等形式）。
					2. 为了改善用户体验，并保证服务的安全性和功能的一致性，技术开发方有权不经向用户特别通知而对应用程序进行更新，或者对应用程序的部分功能效果进行改变或限制。
					六、用户个人信息保护
					1. 保护用户个人信息是技术开发方的一项基本原则，技术开发方将会采取合理的措施保护用户的个人信息。除法律法规规定及用户授权的情形外，未经用户许可技术开发方不会向任何第三方公开、透露用户个人信息。
					2. 用户在登录账号或使用本服务的过程中，可能需要填写一些必要的信息。若用户填写的信息不真实或不完整，则可能无法正常使用本服务。
					3. 一般情况下，用户可随时浏览、修改自己提交的信息，但出于安全性和身份识别的考虑，用户可能无法修改注册时提供的初始注册信息及其他验证信息。
					4. 技术开发方将运用各种安全技术和程序建立完善的管理制度来保护用户的个人信息，以免遭受未经授权的访问、使用或披露。
					七、授权事项及行为规范
					1. 授权事项
					（1）用户充分理解并同意：用户在使用本服务时，可能需要使用用户终端设备的相关权限、接口及相关设备信息等才能实现相应的功能。
				</text>
			</view>
			<view style="text-align: right; margin: 50rpx 0;">更新日期：2022-05-13</view>
		</view>

		<view v-if="type == 1" class="protocol-wrap">
			<view class="protocol-title">
				<text>一亩莲隐私政策</text>
			</view>
			<template>
				<view class="protocol-body">
					<text>
						本应用非常重视用户隐私政策并严格遵守相关的法律规定。请您仔细阅读《隐私政策》后再继续使用。如果您继续使用我们的服务，表示您已经充分阅读和理解我们协议的全部内容。
						本app尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更优质的服务，本应用会按照本隐私权政策的规定使用和披露您的个人信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本应用不会将这些信息对外披露或向第三方提供。本应用会不时更新本隐私权政策。 您在同意本应用服务使用协议之时，即视为您已经同意本隐私权政策全部内容。
						1. 适用范围
						(a) 在您注册本应用app帐号时，您根据app要求提供的个人注册信息；
						(b) 在您使用本应用网络服务，或访问本应用平台网页时，本应用自动接收并记录的您的浏览器和计算机上的信息，包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；
						(c) 本应用通过合法途径从商业伙伴处取得的用户个人数据。
						(d)本应用严禁用户发布不良信息，如裸露、色情和亵渎内容，发布的内容我们会进行审核，一经发现不良信息，会禁用该用户的所有权限，予以封号处理。
						2. 信息使用
						(a)本应用不会向任何无关第三方提供、出售、出租、分享或交易您的个人登录信息。如果我们存储发生维修或升级，我们会事先发出推送消息来通知您，请您提前允许本应用消息通知。
						(b) 本应用亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何本应用平台用户如从事上述活动，一经发现，本应用有权立即终止与该用户的服务协议。
						(c) 为服务用户的目的，本应用可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息，或者与本应用合作伙伴共享信息以便他们向您发送有关其产品和服务的信息（后者需要您的事先同意）。
						3. 信息披露
						在如下情况下，本应用将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：
						(a) 未经您事先同意，我们不会向第三方披露；
						(b)为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；
						(c) 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；
						(d) 如您出现违反中国有关法律、法规或者本应用服务协议或相关规则的情况，需要向第三方披露；
						(e) 如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；
						4. 信息存储和交换
						本应用收集的有关您的信息和资料将保存在本应用及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或本应用收集信息和资料所在地的境外并在境外被访问、存储和展示。
						5. Cookie的使用
						(a) 在您未拒绝接受cookies的情况下，本应用会在您的计算机上设定或取用cookies ，以便您能登录或使用依赖于cookies的本应用平台服务或功能。本应用使用cookies可为您提供更加周到的个性化服务，包括推广服务。
						(b) 您有权选择接受或拒绝接受cookies。您可以通过修改浏览器设置的方式拒绝接受cookies。但如果您选择拒绝接受cookies，则您可能无法登录或使用依赖于cookies的本应用网络服务或功能。
						(c) 通过本应用所设cookies所取得的有关信息，将适用本政策。
						6.本隐私政策的更改
						(a)如果决定更改隐私政策，我们会在本政策中、本公司网站中以及我们认为适当的位置发布这些更改，以便您了解我们如何收集、使用您的个人信息，哪些人可以访问这些信息，以及在什么情况下我们会透露这些信息。
						(b)本公司保留随时修改本政策的权利，因此请经常查看。如对本政策作出重大更改，本公司会通过网站通知的形式告知。
						请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是本应用用户名及密码发生泄露，请您立即联络本应用客服，以便本应用采取相应措施。
						感谢您花时间了解我们的隐私政策！我们将尽全力保护您的个人信息和合法权益，再次感谢您的信任！
					</text>
				</view>
				<view style="text-align: right; margin: 50rpx 0;">更新日期：2022-05-13</view>
			</template>
		</view>


	</view>
</template>

<script>
	export default {
		data() {
			return {
				type: 1
			}
		},
		onReady() {

			let pages = getCurrentPages()
			let currentPage = pages[pages.length - 1]
			let options = currentPage.options
			uni.setNavigationBarTitle({
				title: options.title || '票汇哆'
			})
			if (options.type) {
				this.type = options.type
			}
		},
		methods: {

		}
	}
</script>

<style lang="scss" scoped>
	.protocol-wrap {
		margin: 10rpx 30rpx 60rpx;

		.protocol-title {
			height: 100rpx;
			line-height: 100rpx;
			text-align: center;
			font-weight: bold;
			font-size: 36rpx;
		}

	}
</style>
